index.org
#+AUTHOR: David Pham
#+TITLE: Data analysis tools
#+SETUPFILE: ~/.emacs.d/packs/lang-code/lib/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style> pre.src {background: #3F3F3F; color: #DCDCCC;} </style>

* Introduction

  A friend ask me what I would recommend to learn for people wanting to join
  the field of quantitative finance, machine learning or statistics (the basic
  skills are similar). He also asked to make some small remarks on why I would
  choose these tools.

  First of all, this is only a matter of personal taste and they are a lot of
  reason why someone would learn and act differently, but my hope is that I can
  provide some justification on why I invested time to learn these tools. I
  personally use all the following tools on recurrent basis and I would advise
  to really to learn the basics and use the programs that really help you in
  your daily work. Obviously, this list does miss few programs/languages, the
  reason is probably that I can not assert that I used these other language
  enough to have a decent opinion of them.

  Additional links are provided at the end of the document.

* Quick overview
  This is a list of tools I genuinely recommend to learn and use in our daily
  life when interacting with a computer.

  A good point to remember about the suggestions is they originate from my
  (little) experience and my concern about tractability of the analysis,
  reproducible research, and productivity.

  Let's get started!  Here is a short version:
  + *Ubuntu*. Just do yourself a favor and work in an UNIX environment.
    [[https://ubuntugnome.org/][Ubuntu Gnome homepage]]
  + *Emacs* as your environment: write and code in any language without ever
    without leaving your f/j keys in the same consistent environment.
    [[https://www.gnu.org/software/emacs/][Emacs homepage]] (or [[http://vgoulet.act.ulaval.ca/en/emacs/][here]] for a more friendly-user version).
  + *Git* and *Github*: modern way for archiving, collaborating and working
    with files.
    [[https://git-scm.com/][Git homepage]]
  + *Pandoc, markdown*: write content and not the formatting. Markdown and pandoc
    automate most of the editing tasks.
    [[http://pandoc.org/][Pandoc homepage]]
  + *Python*: your first and most fun programming language. Learn to create
    programs (not class) in a funny and interactive fashion.
    [[https://www.python.org/][Python homepage]]
  + *R*: your friend for visualizing and analyzing data.
    [[https://cran.r-project.org/][R CRAN homepage]] and [[https://www.rstudio.com/][RStudio IDE]] (always handy when starting with R).

* Details
The goal of this section is to provide a basic justification on why I am using
these programs or framework.

** *Ubuntu*
   Any Linux distribution would be fine.  However, I would recommend Ubuntu as
   the first point of entry to the linux world. The advantage over Windows are
   following.
   + Open source software: Most advanced tools for data analysis rely on some
     tools of the UNIX world and their installation is extremely simplified.
   + Ubiquitous terminal: interacting with several languages, tools is the
     favored way of creating analysis (small modular pieces).  Using the shell
     allow us to easily automate the boring tasks with shell scripts.
   + Remote computations: Most cloud computing services are based on a UNIX
     distribution.

** Text editor/IDE: *Emacs*

   This topic is probably one of the most controversial.  Most of my work goes
   around reading and writing. I am unfortunately paid to write and authors
   things: code for analysis, automating tasks, formatting or cleaning data,
   and last but not the least, writing documentations and reports.  One of the
   source of inefficiency when writing documents is the time we move our hands
   from the keyboard to the mouse in order to move the cursor around a document
   or characters.  Emacs provide a rich amount of shortcuts to help the user to
   write everything without leaving the keyboard and it also allows to
   completely modify them as well.
   + Truly personal editor: One of the most interesting feature is also
     that one can really suits Emacs to its need. For example, I have a Swiss
     keyboard, and deleting backwards is a task I often have to do. However,
     with my keyboard layout, I have to move little finger to backspace, which
     disturb my right hand position. Hence, to solve this problem, I simply
     bound /CTRL-é/ and /ALT-é/ to ~delete-char-backwards~ and
     ~delete-word-backward~.
   + One editor for all languages: With Emacs, you will develop code (python,
     R, C++ and clojure are supported), edit text (LaTeX and Markdown) and use
     the shell, all with a consistent set of shortcuts that you set.

   Note that I do not claim, it will be easy at the beginning. However, after a
   few days, Emacs will save you thirty minutes to a hour each day!

** Document generation: *Pandoc* (markdown, LaTeX)
   Stop using Word or Libre Office Writer. Just stop it right now!  The flaw
   with these document editors is the user has only one interface with the
   program for two distinct tasks: content creation and formatting.

   Users often want standard format and focus on the content. LaTeX and
   markdown are markup language that abstract the formatting process from the
   user. Then, the computer takes care of the references, the layout of
   listings, the exact amount of spaces around words.

   *Markdown* is simplified version of LaTeX (but still really capable) and
   *pandoc* is a program that can freely convert your markdown or LaTeX file
   into pdf, html or even docx.

   A good argument in favor of these pure text file is that version control
   come almost for free and UNIX diff functions (to display difference between
   documents) works seamlessly.


