index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Data analysis tools</title>
<!-- 2015-12-25 Fre 00:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Pham" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Data analysis tools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Quick overview</a></li>
<li><a href="#sec-3">3. Details</a>
<ul>
<li><a href="#sec-3-1">3.1. <b>Ubuntu</b></a></li>
<li><a href="#sec-3-2">3.2. Text editor/IDE: <b>Emacs</b></a></li>
<li><a href="#sec-3-3">3.3. Document generation: <b>Pandoc</b> (markdown, LaTeX)</a></li>
<li><a href="#sec-3-4">3.4. Programming languages for data analysis:  <b>python</b> and <b>R</b></a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Python</a></li>
<li><a href="#sec-3-4-2">3.4.2. R</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Version control: <b>git</b> and <b>github</b></a></li>
<li><a href="#sec-3-6">3.6. Finally, if you want to get a corporate job</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. SQL for databases</a></li>
<li><a href="#sec-3-6-2">3.6.2. Excel, VBA</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Intermediate topics</a>
<ul>
<li><a href="#sec-4-1">4.1. Ubuntu</a></li>
<li><a href="#sec-4-2">4.2. Emacs</a></li>
<li><a href="#sec-4-3">4.3. Document generation</a></li>
<li><a href="#sec-4-4">4.4. Python</a></li>
<li><a href="#sec-4-5">4.5. R</a></li>
<li><a href="#sec-4-6">4.6. Statistics: Repeat the basics</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Links</a>
<ul>
<li><a href="#sec-5-1">5.1. Data analysis</a></li>
<li><a href="#sec-5-2">5.2. Git and Github</a></li>
<li><a href="#sec-5-3">5.3. Python</a></li>
<li><a href="#sec-5-4">5.4. R</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
A friend ask me what I would recommend to learn for people wanting to join
the field of quantitative finance, machine learning or statistics (the basic
skills are similar). He also asked to make some small remarks on why I would
choose these tools.
</p>

<p>
First of all, this is only a matter of personal taste and they are a lot of
reason why someone would learn and act differently, but my hope is that I can
provide some justification on why I invested time to learn these tools. I
personally use all the following tools on recurrent basis and I would advise
to really to learn the basics and use the programs that really help you in
your daily work. Obviously, this list does miss few programs/languages, the
reason is probably that I can not assert that I used these other language
enough to have a decent opinion of them.
</p>

<p>
Additional links are provided at the end of the document.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Quick overview</h2>
<div class="outline-text-2" id="text-2">
<p>
This is a list of tools I genuinely recommend to learn and use in our daily
life when interacting with a computer.
</p>

<p>
A good point to remember about the suggestions is they originate from my
(little) experience and my concern about tractability of the analysis,
reproducible research, and productivity.
</p>

<p>
Let's get started!  Here is a short version:
</p>
<ul class="org-ul">
<li><b>Ubuntu</b>. Just do yourself a favor and work in an UNIX environment.
<a href="https://ubuntugnome.org/">Ubuntu Gnome homepage</a>
</li>
<li><b>Emacs</b> as your environment: write and code in any language without ever
without leaving your f/j keys in the same consistent environment.
<a href="https://www.gnu.org/software/emacs/">Emacs homepage</a> (or <a href="http://vgoulet.act.ulaval.ca/en/emacs/">here</a> for a more friendly-user version).
</li>
<li><b>Git</b> and <b>Github</b>: modern way for archiving, collaborating and working
with files.
<a href="https://git-scm.com/">Git homepage</a>
</li>
<li><b>Pandoc, markdown</b>: write content and not the formatting. Markdown and pandoc
automate most of the editing tasks.
<a href="http://pandoc.org/">Pandoc homepage</a>
</li>
<li><b>Python</b>: your first and most fun programming language. Learn to create
programs (not class) in a funny and interactive fashion.
<a href="https://www.python.org/">Python homepage</a>
</li>
<li><b>R</b>: your friend for visualizing and analyzing data.
<a href="https://cran.r-project.org/">R CRAN homepage</a> and <a href="https://www.rstudio.com/">RStudio IDE</a> (always handy when starting with R).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Details</h2>
<div class="outline-text-2" id="text-3">
<p>
The goal of this section is to provide a basic justification on why I am using
these programs or framework.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <b>Ubuntu</b></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Any Linux distribution would be fine.  However, I would recommend Ubuntu as
the first point of entry to the linux world. The advantage over Windows are
following.
</p>
<ul class="org-ul">
<li>Open source software: Most advanced tools for data analysis rely on some
tools of the UNIX world and their installation is extremely simplified.
</li>
<li>Ubiquitous terminal: interacting with several languages, tools is the
favored way of creating analysis (small modular pieces).  Using the shell
allow us to easily automate the boring tasks with shell scripts.
</li>
<li>Remote computations: Most cloud computing services are based on a UNIX
distribution.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Text editor/IDE: <b>Emacs</b></h3>
<div class="outline-text-3" id="text-3-2">
<p>
This topic is probably one of the most controversial.  Most of my work goes
around reading and writing. I am unfortunately paid to write and authors
things: code for analysis, automating tasks, formatting or cleaning data,
and last but not the least, writing documentations and reports.  One of the
source of inefficiency when writing documents is the time we move our hands
from the keyboard to the mouse in order to move the cursor around a document
or characters.  Emacs provide a rich amount of shortcuts to help the user to
write everything without leaving the keyboard and it also allows to
completely modify them as well.
</p>
<ul class="org-ul">
<li>Truly personal editor: One of the most interesting feature is also
that one can really suits Emacs to its need. For example, I have a Swiss
keyboard, and deleting backwards is a task I often have to do. However,
with my keyboard layout, I have to move little finger to backspace, which
disturb my right hand position. Hence, to solve this problem, I simply
bound <i>CTRL-é</i> and <i>ALT-é</i> to <code>delete-char-backwards</code> and
<code>delete-word-backward</code>.
</li>
<li>One editor for all languages: With Emacs, you will develop code (python,
R, C++ and clojure are supported), edit text (LaTeX and Markdown) and use
the shell, all with a consistent set of shortcuts that you set.
</li>
</ul>

<p>
Note that I do not claim, it will be easy at the beginning. However, after a
few days, Emacs will save you thirty minutes to a hour each day!
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Document generation: <b>Pandoc</b> (markdown, LaTeX)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Stop using Word or Libre Office Writer. Just stop it right now!  The flaw
with these document editors is the user has only one interface with the
program for two distinct tasks: content creation and formatting.
</p>

<p>
Users often want standard format and focus on the content. LaTeX and
markdown are markup language that abstract the formatting process from the
user. Then, the computer takes care of the references, the layout of
listings, the exact amount of spaces around words.
</p>

<p>
<b>Markdown</b> is simplified version of LaTeX (but still really capable) and
<b>pandoc</b> is a program that can freely convert your markdown or LaTeX file
into pdf, html or even docx.
</p>

<p>
A good argument in favor of these pure text file is that version control
come almost for free and UNIX diff functions (to display difference between
documents) works seamlessly.
</p>
</div>
</div>
