index.org
** Programming languages for data analysis:  *python* and *R*

   There is no clear winner between the two languages when analyzing data and
   each of them has its own advantages. Both provide great advantages:

   + REPL (interactive console for coding);
   + Open source;
   + A wonderful open source community;
   + An uncountable set of tutorials for beginning;
   + Object-oriented and functional programming paradigm;
   + Easy interaction with most used compiled languages (C, C++, Java).
   + Exceptional documentation for the base package.

   Advice: if you have little experience in coding, I totally support learning
   *python* first and then quickly pick up with *R*, because *python* also
   emphasis data structures (aka speed of your code) and software engineering
   (maintainability).

   Main differences are emphasized in the next subsections.

*** Python
    Python is often favored by the machine learning community.
    + All-battery included programming languages: there is a module for almost
      everything in the base installation (csv, itertools, regular expression).
    + Explicit data structure (list, tuple, set, frozenset, hash-map/dictionary).
    + There is only ONE true way of writing code (so most people tend to have
      the same style).
    + It has one of the most beautiful syntax among programming languages.
    + There is a default support for module (that is writing code in other
      files) and the device is trivial to use.

*** R
    R is the standard programming language for most data analysts.
    + Almost any statistical learning algorithm has already been implemented
      and is available on CRAN.
    + Installation of new packages is a lot easier, when the user has no *admin
      rights*. This is really important as most companies do not provide them
      to their employees.
    + Programming language created by statisticians for statisticians.
    + Syntax is really targeted for performing data analysis.
    + Fairly high level language. Packages should take care of most system error
      (segmentation fault or out of bound memory).
    + Amazing data visualization capabilities.
    + Interactive data visualization with javascript is definitively more
      advanced than with python.
    + /Vectorized/ operations are favored to ~for~ loop.

** Version control: *git* and *github*
   I have honestly used them since only recently. Hence my opinion and my
   experience might not be really significant. But version control definitively
   helps. It avoids having archive folders everywhere, and it tracts the
   development of our work.
** Finally, if you want to get a corporate job
*** SQL for databases
    I am honestly not a specialist of databases, especially as I prefer simple
    format such as csv. But as data grow larger, it is clear that database have
    advantage. I suppose we will only remain user, so it does help to know the
    basics of SQL. From there, a lot of language are similar but if one has to
    write queries often, some packages from python or R will help to not
    become crazy.
*** Excel, VBA
    Excel and VBA are the most dangerous tools in the corporate world. Anyone
    can make extremely advanced data analysis and plots. However, it is almost
    impossible to reproduce the research and to avoid mistakes. Hence my advice
    is that, if possible, try everything to avoid using with Excel files:
    + Use some python module to interact with Excel.
    + Create vba macros to export/import data in ~.csv~ and call a python
      script with the ~Shell~ vba function to work with the data.

    If anyhow, you still MUST use Excel, here are some tricks:
    + Excel
      + Pivot table allows to create simple "*-by" summary of your data
        (e.g. "sum-by region", "count-by country").
      + Filter function and deleting duplicate elements are great built-in
        tools.
      + ~vlookup~: the best way to reproduce the behavior of hash-map in Excel.
    + VBA
      + Record macro is your best friend.
      + Turn off display updating when running macros.
      + If possible, work with arrays in memory and not cells on the
        spreadsheet.
      + Use Excel functions whenever possible.
      + Include Microsoft.Scripting module to get hash-maps (associative
        arrays).
      + When filtering data, use the ~filter~ function from Excel with the
        correct parameters.

* Intermediate topics
I consider here some intermediate topics
** Ubuntu

** Emacs
   My point of view is kind of biased from this blog post.
   # TODO: add link to IDE Culture.
   My point is, one should use the same tool at work and at home, as I would
   like my improve my skill especially when I am working.

   Moreover, using a bare text editor force professional to understand the
   engineering process behind their analysis and also when the constraints for
   scaling.

** Document generation
   A good option in combination with Emacs is to use *Org-mode* for *literate
   programming*. Org-mode is an equivalent of markdown (and is also supported
   by pandoc). Nevertheless, it provides a better integration with Emacs and
   its default HTML and LaTeX output hare nicer. Bonus: it is a really good
   TODO list remainder.

   Literate programming is also an interesting topic: usually, programmers
   write code, filled with comments, but this could or should be
   reverse. Authors should write text with code blocks describing their
   views. Org-mode totally support this type of document. For a good
   alternative, search for ~rmarkdown~.

** Python

   The *Scipy* stack includes most of what you will ever need to replace
   matlab: numpy (approximately matrix calculation), scipy (optimization and
   numerical mathematics), ipython (a better repl/interactive console), pandas
   (data.frame like data structure), simpy (symbolic mathematics) and nose (for
   testing). *pandas* is the most important package to learn for data analysis.

   *Scikit-learn* offers most machine learning algorithm for statistical
   prediction. *Seaborn* is a great abstraction over matplotlib for plotting
   *data.

