index.html


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Programming languages for data analysis:  <b>python</b> and <b>R</b></h3>
<div class="outline-text-3" id="text-3-4">
<p>
There is no clear winner between the two languages when analyzing data and
each of them has its own advantages. Both provide great advantages:
</p>

<ul class="org-ul">
<li>REPL (interactive console for coding);
</li>
<li>Open source;
</li>
<li>A wonderful open source community;
</li>
<li>An uncountable set of tutorials for beginning;
</li>
<li>Object-oriented and functional programming paradigm;
</li>
<li>Easy interaction with most used compiled languages (C, C++, Java).
</li>
<li>Exceptional documentation for the base package.
</li>
</ul>

<p>
Advice: if you have little experience in coding, I totally support learning
<b>python</b> first and then quickly pick up with <b>R</b>, because <b>python</b> also
emphasis data structures (aka speed of your code) and software engineering
(maintainability).
</p>

<p>
Main differences are emphasized in the next subsections.
</p>
</div>

<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Python</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Python is often favored by the machine learning community.
</p>
<ul class="org-ul">
<li>All-battery included programming languages: there is a module for almost
everything in the base installation (csv, itertools, regular expression).
</li>
<li>Explicit data structure (list, tuple, set, frozenset, hash-map/dictionary).
</li>
<li>There is only ONE true way of writing code (so most people tend to have
the same style).
</li>
<li>It has one of the most beautiful syntax among programming languages.
</li>
<li>There is a default support for module (that is writing code in other
files) and the device is trivial to use.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> R</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
R is the standard programming language for most data analysts.
</p>
<ul class="org-ul">
<li>Almost any statistical learning algorithm has already been implemented
and is available on CRAN.
</li>
<li>Installation of new packages is a lot easier, when the user has no <b>admin
rights</b>. This is really important as most companies do not provide them
to their employees.
</li>
<li>Programming language created by statisticians for statisticians.
</li>
<li>Syntax is really targeted for performing data analysis.
</li>
<li>Fairly high level language. Packages should take care of most system error
(segmentation fault or out of bound memory).
</li>
<li>Amazing data visualization capabilities.
</li>
<li>Interactive data visualization with javascript is definitively more
advanced than with python.
</li>
<li><i>Vectorized</i> operations are favored to <code>for</code> loop.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Version control: <b>git</b> and <b>github</b></h3>
<div class="outline-text-3" id="text-3-5">
<p>
I have honestly used them since only recently. Hence my opinion and my
experience might not be really significant. But version control definitively
helps. It avoids having archive folders everywhere, and it tracts the
development of our work.
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Finally, if you want to get a corporate job</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> SQL for databases</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
I am honestly not a specialist of databases, especially as I prefer simple
format such as csv. But as data grow larger, it is clear that database have
advantage. I suppose we will only remain user, so it does help to know the
basics of SQL. From there, a lot of language are similar but if one has to
write queries often, some packages from python or R will help to not
become crazy.
</p>
</div>
</div>
<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> Excel, VBA</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
Excel and VBA are the most dangerous tools in the corporate world. Anyone
can make extremely advanced data analysis and plots. However, it is almost
impossible to reproduce the research and to avoid mistakes. Hence my advice
is that, if possible, try everything to avoid using with Excel files:
</p>
<ul class="org-ul">
<li>Use some python module to interact with Excel.
</li>
<li>Create vba macros to export/import data in <code>.csv</code> and call a python
script with the <code>Shell</code> vba function to work with the data.
</li>
</ul>

<p>
If anyhow, you still MUST use Excel, here are some tricks:
</p>
<ul class="org-ul">
<li>Excel
<ul class="org-ul">
<li>Pivot table allows to create simple "*-by" summary of your data
(e.g. "sum-by region", "count-by country").
</li>
<li>Filter function and deleting duplicate elements are great built-in
tools.
</li>
<li><code>vlookup</code>: the best way to reproduce the behavior of hash-map in Excel.
</li>
</ul>
</li>
<li>VBA
<ul class="org-ul">
<li>Record macro is your best friend.
</li>
<li>Turn off display updating when running macros.
</li>
<li>If possible, work with arrays in memory and not cells on the
spreadsheet.
</li>
<li>Use Excel functions whenever possible.
</li>
<li>Include Microsoft.Scripting module to get hash-maps (associative
arrays).
</li>
<li>When filtering data, use the <code>filter</code> function from Excel with the
correct parameters.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Intermediate topics</h2>
<div class="outline-text-2" id="text-4">
<p>
I consider here some intermediate topics
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Ubuntu</h3>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Emacs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
My point of view is kind of biased from this blog post.
</p>
<p>
My point is, one should use the same tool at work and at home, as I would
like my improve my skill especially when I am working.
</p>

<p>
Moreover, using a bare text editor force professional to understand the
engineering process behind their analysis and also when the constraints for
scaling.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Document generation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A good option in combination with Emacs is to use <b>Org-mode</b> for <b>literate
programming</b>. Org-mode is an equivalent of markdown (and is also supported
by pandoc). Nevertheless, it provides a better integration with Emacs and
its default HTML and LaTeX output hare nicer. Bonus: it is a really good
TODO list remainder.
</p>

<p>
Literate programming is also an interesting topic: usually, programmers
write code, filled with comments, but this could or should be
reverse. Authors should write text with code blocks describing their
views. Org-mode totally support this type of document. For a good
alternative, search for <code>rmarkdown</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Python</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The <b>Scipy</b> stack includes most of what you will ever need to replace
matlab: numpy (approximately matrix calculation), scipy (optimization and
numerical mathematics), ipython (a better repl/interactive console), pandas
(data.frame like data structure), simpy (symbolic mathematics) and nose (for
testing). <b>pandas</b> is the most important package to learn for data analysis.
</p>

<p>
<b>Scikit-learn</b> offers most machine learning algorithm for statistical
prediction. <b>Seaborn</b> is a great abstraction over matplotlib for plotting
*data.
</p>
</div>
</div>
