index.org
** R
   There are several types of R packages: packages providing statistical
   models, others providing infrastructures for performing analysis. I will
   give you some advice for the second type of packages.

   *simsalapar* abstract and provide a great framework for computing simulation
   over grids of parameters.

   *data.table* is probably the most interesting packages. It offers a C++
   implementation of the data.frame data structure and provides incredible
   speed up. The ~fread~ function also accelerate incredibly the loading of
   /csv/ data. One of the drawback is the way it uses expression and is maybe
   not the most natural way for R programmers to use it.

   *ggplot2* and *lattice* make the plotting experience of R even
   sweeter. lattice gives quick visualization for faceting (e.g. xy-plot for
   /x/ against /y/ grouped by /z/), whereas ggplot2 wraps the *grid* package to
   make highly customized data visualization. lattice is often faster than
   ggplot2, but ggplot2 is maintained and its output can customized.

   *caret* abstracts the best practices of data analysis to allow more
   flexibility. It offers a framework to compare and average models and perform
   the split of data (test-training-evaluation set) automatically.

   *parallel* come by default in R. I suggest to learn how to write parallel
   code with clusters and not with multiple cores. The reason is that forking
   copies completely your master thread which could cause some problem if you
   have a finite amount of RAM.

   *timeDate* from the RiskMetrics team is a really appreciable abstraction of
   calendar issue in the financial world.

   *regular expression* (or *regex*) are supported by default in R, learn about
   them, they are life savers!

   *magrittr* provides the pipe operator ~%>%~. More or less, it allows to read
   expression from left to right, compared to inside to outside:
   #+BEGIN_SRC R
   x %>% f %>% g(y) == g(f(x), y) # TRUE
   #+END_SRC

** Statistics: Repeat the basics
   I love shiny statistical learning methods, I mean, I do love them (neural
   networks, lasso/ridge regression, random forest, copula modeling). However, I
   am convinced that for mastery, one do have to repeat the basics often and to
   have solid understanding of what /randomness/ means in statistics

* Links
** Data analysis
   + [[http://www.math.uwaterloo.ca/~mhofert/contents/guidelines.pdf][Guidelines for Statistical Projects: Coding and Typography]]:  Great reading
     and advice.
** Git and Github
   + [[https://www.udacity.com/course/how-to-use-git-and-github--ud775][Gentle introduction]] to git and github.
   + [[https://git-scm.com/][Official website]]
** Python
   + [[https://www.udacity.com/course/intro-to-computer-science--cs101][Best introduction ever]]
   + [[http://www.scipy.org/][Scipy]]
   + [[http://scikit-learn.org/][Scikit]]
   + [[http://stanford.edu/~mwaskom/software/seaborn][Seaborn]]
** R
   + [[http://arxiv.org/pdf/1309.4402v1][Simsalapar]] documentation
   + [[http://ess.r-project.org/index.php?Section=download][Emacs integration with R]]
