index.html

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> R</h3>
<div class="outline-text-3" id="text-4-5">
<p>
There are several types of R packages: packages providing statistical
models, others providing infrastructures for performing analysis. I will
give you some advice for the second type of packages.
</p>

<p>
<b>simsalapar</b> abstract and provide a great framework for computing simulation
over grids of parameters.
</p>

<p>
<b>data.table</b> is probably the most interesting packages. It offers a C++
implementation of the data.frame data structure and provides incredible
speed up. The <code>fread</code> function also accelerate incredibly the loading of
<i>csv</i> data. One of the drawback is the way it uses expression and is maybe
not the most natural way for R programmers to use it.
</p>

<p>
<b>ggplot2</b> and <b>lattice</b> make the plotting experience of R even
sweeter. lattice gives quick visualization for faceting (e.g. xy-plot for
<i>x</i> against <i>y</i> grouped by <i>z</i>), whereas ggplot2 wraps the <b>grid</b> package to
make highly customized data visualization. lattice is often faster than
ggplot2, but ggplot2 is maintained and its output can customized.
</p>

<p>
<b>caret</b> abstracts the best practices of data analysis to allow more
flexibility. It offers a framework to compare and average models and perform
the split of data (test-training-evaluation set) automatically.
</p>

<p>
<b>parallel</b> come by default in R. I suggest to learn how to write parallel
code with clusters and not with multiple cores. The reason is that forking
copies completely your master thread which could cause some problem if you
have a finite amount of RAM.
</p>

<p>
<b>timeDate</b> from the RiskMetrics team is a really appreciable abstraction of
calendar issue in the financial world.
</p>

<p>
<b>regular expression</b> (or <b>regex</b>) are supported by default in R, learn about
them, they are life savers!
</p>

<p>
<b>magrittr</b> provides the pipe operator <code>%&gt;%</code>. More or less, it allows to read
expression from left to right, compared to inside to outside:
</p>
<div class="org-src-container">

<pre class="src src-R">x %&gt;% f %&gt;% <span style="color: #94BFF3;">g</span><span style="color: #DCDCCC;">(</span>y<span style="color: #DCDCCC;">)</span> == <span style="color: #94BFF3;">g</span><span style="color: #DCDCCC;">(</span><span style="color: #94BFF3;">f</span><span style="color: #BFEBBF;">(</span>x<span style="color: #BFEBBF;">)</span>, y<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">TRUE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Statistics: Repeat the basics</h3>
<div class="outline-text-3" id="text-4-6">
<p>
I love shiny statistical learning methods, I mean, I do love them (neural
networks, lasso/ridge regression, random forest, copula modeling). However, I
am convinced that for mastery, one do have to repeat the basics often and to
have solid understanding of what <i>randomness</i> means in statistics
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Links</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Data analysis</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="http://www.math.uwaterloo.ca/~mhofert/contents/guidelines.pdf">Guidelines for Statistical Projects: Coding and Typography</a>:  Great reading
and advice.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Git and Github</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><a href="https://www.udacity.com/course/how-to-use-git-and-github--ud775">Gentle introduction</a> to git and github.
</li>
<li><a href="https://git-scm.com/">Official website</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Python</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><a href="https://www.udacity.com/course/intro-to-computer-science--cs101">Best introduction ever</a>
</li>
<li><a href="http://www.scipy.org/">Scipy</a>
</li>
<li><a href="http://scikit-learn.org/">Scikit</a>
</li>
<li><a href="http://stanford.edu/~mwaskom/software/seaborn">Seaborn</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> R</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li><a href="http://arxiv.org/pdf/1309.4402v1">Simsalapar</a> documentation
</li>
<li><a href="http://ess.r-project.org/index.php?Section=download">Emacs integration with R</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Pham</p>
<p class="date">Created: 2015-12-25 Fre 00:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
